examples/diamond2D_Ma2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
|  \\\\    /   O peration     | OpenFOAM rhoCentralFoam (4.x config from wedge) |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0; format ascii; class volScalarField; object p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1;
boundaryField
{
    inlet        { type fixedValue; value uniform 1; }
    outlet       { type zeroGradient; }
    top          { type zeroGradient; }
    symmetry     { type symmetryPlane; }
    airfoilFront { type zeroGradient; }
    airfoilRear  { type zeroGradient; }
    defaultFaces { type empty; }
}
// ************************************************************************* //
