examples/diamond2D_Ma2/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 16;             // Match --ntasks in submit.sh exactly.

method          scotch;            // Graph-based partitioning; no coeffs needed.

// Fallback if your OpenFOAM build lacks scotch: switch `method` to `simple`
// and uncomment the block below (last entry MUST be 1 for this 2D case).
//
// simpleCoeffs
// {
//     n               (4 4 1);
//     delta           0.001;
// }

distributed     no;
roots           ( );

// ************************************************************************* //
